In [1]:
# отключим предупреждения
import warnings
warnings.simplefilter('ignore')
import pandas as pd

**Считаем данные из файла в память в виде объекта Pandas.DataFrame**

In [2]:
data = pd.read_csv('titanic_train.csv', index_col='PassengerId')

In [3]:
data.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [4]:
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

**Примеры создания признаков**

In [5]:
def age_category(age):
    '''
    < 30 -> 1
    >= 30, <55 -> 2
    >= 55 -> 3
    '''
    if age < 30:
        return 1
    elif age < 55:
        return 2
    else:
        return 3

In [6]:
age_categories = [age_category(age) for age in data.Age]

In [7]:
data['Age_category'] = age_categories

**Другой способ - c apply**

In [8]:
data['Age_category'] = data['Age'].apply(age_category)

In [9]:
data['Num_relatives'] = data['Parch'] + data['SibSp']

In [10]:
data['Num_relatives'].value_counts()

0     537
1     161
2     102
3      29
5      22
4      15
6      12
10      7
7       6
Name: Num_relatives, dtype: int64

**1. Сколько мужчин / жещин находилось на борту?**

In [11]:
print('Men:', len(data[data['Sex'] == 'male']))
print('Women:', len(data[data['Sex'] == 'female']))

Men: 577
Women: 314

**2. C помощью value_counts (либо своим способом) выведите распределение колонки Pclass(социально-экономический статус). Дополнительно выведите это распределение отдельно для мужчин / женщин.**

In [12]:
data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [13]:
data[data['Sex'] == 'male']['Pclass'].value_counts()

3    347
1    122
2    108
Name: Pclass, dtype: int64

In [14]:
data[data['Sex'] == 'female']['Pclass'].value_counts()

3    144
1     94
2     76
Name: Pclass, dtype: int64

**3. Сколько в среднем заплатил один пассажир? Найдите стандартное отклонение этой величины. Лучше округлить до 2 десятичных знаков.**

In [15]:
data['Fare'].mean().round(2)

32.2

In [16]:
data['Fare'].std().round(2)

49.69

**4. Правда ли, что молодые выживали чаще (с большей вероятностью), чем старики? Пусть "молодые" - те, кто моложе 30, а "старики" - те, кто старше 60.**

In [17]:
data[data['Age'] <= 30]['Survived'].value_counts(normalize = True)

0    0.594132
1    0.405868
Name: Survived, dtype: float64

In [18]:
data[data['Age'] >= 60]['Survived'].value_counts(normalize = True)

0    0.730769
1    0.269231
Name: Survived, dtype: float64

**5. Правда ли, что женщины выживали чаще мужчин?**

In [19]:
data[['Survived','Sex']][data.Sex == 'male'].value_counts(normalize = True)

Survived  Sex
0         male    0.811092
1         male    0.188908
dtype: float64

In [20]:
data[['Survived','Sex']][data.Sex == 'female'].value_counts(normalize = True).sort_values()

Survived  Sex
0         female    0.257962
1         female    0.742038
dtype: float64

**6. Какое самое популярное имя среди пассажиров Титаника мужского пола?**

In [21]:
# #порядок действий
# фильтр male
# сделать колонку name_new
# посчитать value_counts()

# names = list(set([name.split('.')[1].split(' ')[1] for name in data[data.Sex == 'male'].Name]))

data['Actual_name'] = [name.split('.')[1].split(' ')[1] for name in data.Name]

data[data.Sex == 'male'].Actual_name.value_counts()

William    35
John       25
George     14
Charles    13
Thomas     13
           ..
Malkolm     1
Austin      1
Husein      1
Herman      1
Orsen       1
Name: Actual_name, Length: 287, dtype: int64

**8. Как отличается средний возраст мужчин / женщин в зависимости от класса обслуживания?**

In [22]:
data[(data.Sex == 'male') & (data.Pclass == 1)].Age.mean()

41.28138613861386

In [23]:
data[(data.Sex == 'male') & (data.Pclass == 2)].Age.mean()

30.74070707070707

In [24]:
data[(data.Sex == 'male') & (data.Pclass == 3)].Age.mean()

26.507588932806325

In [25]:
data[(data.Sex == 'female') & (data.Pclass == 1)].Age.mean()

34.61176470588235

In [26]:
data[(data.Sex == 'female') & (data.Pclass == 2)].Age.mean()

28.722972972972972

In [27]:
data[(data.Sex == 'female') & (data.Pclass == 3)].Age.mean()

21.75

In [28]:
pd.crosstab(data.Sex, data.Pclass, values=data.Age, aggfunc='mean')

Pclass          1          2          3
Sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589